# DataFrame

## 22 DataFrame的创建

In [1]:
import pandas as pd
pd.DataFrame({'one':[1,2,3],'two':[4,5,6]}, index=['a','b','c'])

   one  two
a    1    4
b    2    5
c    3    6

In [7]:
df = _
df

   one  two
a    1    4
b    2    5
c    3    6

In [22]:
!type nul> test.csv

In [8]:
df.to_csv('test.csv')

## 23 DataFrame常用属性

In [9]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [10]:
df.values

array([[1, 4],
       [2, 5],
       [3, 6]], dtype=int64)

In [11]:
df.T

     a  b  c
one  1  2  3
two  4  5  6

In [12]:
df.columns

Index(['one', 'two'], dtype='object')

In [18]:
df.describe()  # 描述

       one  two
count  3.0  3.0
mean   2.0  5.0
std    1.0  1.0
min    1.0  4.0
25%    1.5  4.5
50%    2.0  5.0
75%    2.5  5.5
max    3.0  6.0

In [19]:
df.values

array([[1, 4],
       [2, 5],
       [3, 6]], dtype=int64)

##  24 索引和切片

In [20]:
df

   one  two
a    1    4
b    2    5
c    3    6

In [22]:
df['one']['b']

2

In [26]:
df.loc['a':'c','one']

a    1
b    2
c    3
Name: one, dtype: int64

In [25]:
df.iloc[0:2,0]

a    1
b    2
Name: one, dtype: int64

## 25 数据对齐与缺失数据的处理

In [27]:
df = pd.DataFrame({'two':[1,2,3,4], 'one':[5,6,7,8]}, index=['c','d','b','a'])

In [29]:
df

   two  one
c    1    5
d    2    6
b    3    7
a    4    8

In [30]:
df2 = _20

In [31]:
df2

   one  two
a    1    4
b    2    5
c    3    6

In [32]:
df + df2

   one  two
a  9.0  8.0
b  9.0  8.0
c  8.0  7.0
d  NaN  NaN

In [35]:
df

   two  one
c    1    5
d    2    6
b    3    7
a    4    8

In [40]:
import numpy as np
df.loc['c','two'] = np.nan
df

   two  one
c  NaN    5
d  2.0    6
b  3.0    7
a  4.0    8

In [41]:
df.dropna()

   two  one
d  2.0    6
b  3.0    7
a  4.0    8

In [42]:
df

   two  one
c  NaN    5
d  2.0    6
b  3.0    7
a  4.0    8

In [43]:
df.dropna(axis=1)

   one
c    5
d    6
b    7
a    8

## 26 pandas 常用函数

In [45]:
# mean 求平均值
print(df)
df.mean()

   two  one
c  NaN    5
d  2.0    6
b  3.0    7
a  4.0    8

two    3.0
one    6.5
dtype: float64

In [46]:
df.mean(axis=1)

c    5.0
d    4.0
b    5.0
a    6.0
dtype: float64

In [47]:
# sum 求和
df.sum()

two     9.0
one    26.0
dtype: float64

In [50]:
# 按值排序
df.sort_values(by='two', ascending=False)

   two  one
a  4.0    8
b  3.0    7
d  2.0    6
c  NaN    5

In [52]:
# 按标签排序
df.sort_index()

   two  one
a  4.0    8
b  3.0    7
c  NaN    5
d  2.0    6